//미니프로젝트 . 성적관리 프로그램
//문제설명
//1차 객체배열 리스트을 통해 데이타를 관리한다. - 배열을 10개정도 만들어서 사용해도 됨, 아니면 ArrayList를 이용하여 사용함.
//아래 콘솔과 같이 입력 및 출력되도록 한다.
//입력 및 출력 예시
//-----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 1
//이름 입력 : 홍길동
//국어점수 입력 : 70
//영어점수 입력 : 80
//수학점수 입력 : 90
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 2
//이름: 홍길동 국어: 70 영어: 80 수학: 90 총점: 240 평균: 80.0
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 1
//이름 입력 : 변사또
//국어점수 입력 : 30
//영어점수 입력 : 49
//수학점수 입력 : 59
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 2
//이름: 홍길동 국어: 70 영어: 80 수학: 90 총점: 240 평균: 80.0
//이름: 변사또 국어: 30 영어: 49 수학: 59 총점: 138 평균: 46.0
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 3
//검색할 사람의 이름 : 홍길동
//이름: 홍길동 국어: 70 영어: 80 수학: 90 총점: 240 평균: 80.0
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 4
//수정할 사람의 이름 : 홍길동
//수정할 내용은? 1.국어 2.영어 3.수학 : 1
//국어점수 수정 : 50
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 2
//이름: 홍길동 국어: 50 영어: 80 수학: 90 총점: 220 평균: 73.33333333333333
//이름: 변사또 국어: 30 영어: 49 수학: 59 총점: 138 평균: 46.0
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 5
//삭제할 사람의 이름 : 변사또
//-----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 2
//이름: 홍길동 국어: 50 영어: 80 수학: 90 총점: 220 평균: 73.33333333333333
//        -----------성적 관리 프로그램-------------
//        1.입력 2.전체출력 3.검색 4.수정 5.삭제 6.종료 : 6
//종료!!
//종료 코드 0(으)로 완료된 프로세스

public class grade {
}
